OpenEPaperLink/OpenEPaperLink/ESP32_AP-Flasher/src/ble_filter.cpp
static uint64_t BLE_macToKey(const uint8_t mac[8]) {
    uint64_t key = 0;
    for (int i = 0; i < 8; i++) key = (key << 8) | mac[i];
    return key;
}

static bool BLE_isPendingCandidate(tagRecord* taginfo) {
    if (taginfo->pendingCount == 0 || taginfo->version != 0) return false;
    // Gicisky / other BLE displays, or an ATC BLE OEPL tag (MAC starts 0x1337)
    return ((taginfo->hwType & 0xB0) == 0xB0) || (taginfo->mac[7] == 0x13 && taginfo->mac[6] == 0x37);
}

// Call once an upload finished (success or given up) so a later re-add of the
// same tag starts fresh and isn't unfairly deprioritized.
void BLE_clear_attempts(uint8_t address[8]) {
    BLE_attemptCounts.erase(BLE_macToKey(address));
}

bool BLE_is_image_pending(uint8_t address[8]) {
    // Pick the pending BLE tag we have tried the fewest times. This way an
    // unreachable display no longer blocks the queue: every attempt rotates to
    // the next-least-tried tag, so all reachable uploads get their turn and
    // finish even while some tags stay offline.
    tagRecord* best = nullptr;
    uint32_t bestAttempts = 0;
    for (int16_t c = 0; c < tagDB.size(); c++) {
        tagRecord* taginfo = tagDB.at(c);
        if (!BLE_isPendingCandidate(taginfo)) continue;
        uint32_t attempts = BLE_attemptCounts[BLE_macToKey(taginfo->mac)];
        if (best == nullptr || attempts < bestAttempts) {
            best = taginfo;
            bestAttempts = attempts;
        }
    }
    if (best == nullptr) return false;

    memcpy(address, best->mac, 8);
    BLE_attemptCounts[BLE_macToKey(best->mac)]++;  // count this attempt so the next round prefers the others
    if (best->mac[7] == 0x13 && best->mac[6] == 0x37) {
        Serial.printf("ATC BLE OEPL data Waiting\r\n");
    }
    return true;
}

uint8_t swapBits(uint8_t num) {
    uint8_t result = 0;
    for (int i = 0; i < 8; ++i) {
        result |= ((num >> i) & 0x01) << (7 - i);
    }
    return result;
}

uint32_t compress_image(uint8_t address[8], uint8_t* buffer, uint32_t max_len) {
    uint32_t t = millis();
    PendingItem* queueItem = getQueueItem(address, 0);
    if (queueItem == nullptr) {
        prepareCancelPending(address);
        Serial.printf("blockrequest: couldn't find taginfo %02X%02X%02X%02X%02X%02X%02X%02X\r\n", address[7], address[6], address[5], address[4], address[3], address[2], address[1], address[0]);
        return 0;
    }
    if (queueItem->data == nullptr) {
        fs::File file = contentFS->open(queueItem->filename);
        if (!file) {
            Serial.print("No current file. " + String(queueItem->filename) + " Canceling request\r\n");
            prepareCancelPending(address);
            return 0;
        }
        queueItem->data = getDataForFile(file);
        Serial.println("Reading file " + String(queueItem->filename) + " in  " + String(millis() - t) + "ms");
        file.close();
    }

    uint16_t giciType = (address[7] << 8) | address[6];  // here we "extract" the display info again

    uint8_t screenResolution = (giciType >> 5) & 63;
    uint8_t dispPtype = (giciType >> 3) & 3;
    uint8_t availColors = ((giciType >> 1) & 3);
    uint8_t special_color = ((giciType >> 10) & 12);
    uint8_t singleDoubleMirror = giciType & 1;
    uint8_t canDoCompression = (giciType & 0x4000) ? 0 : 1;

    bool extra_color = false;
    bool extra_tft_bitshifting = false;
    bool mirror_width = false;
    uint16_t width_display = 104;
    uint16_t height_display = 212;

    switch (screenResolution) {
        case 0:
            width_display = 216;
            height_display = 104;
            break;
        case 1:
            width_display = 296;
            height_display = 128;
            break;
        case 2:
            width_display = 300;
            height_display = 400;
            break;
        case 3:
            width_display = 640;
            height_display = 384;
            break;
        case 4:
            width_display = 960;
            height_display = 640;
            break;
        case 5:
            width_display = 250;
            height_display = 136;
            break;
        case 6:
            width_display = 196;
            height_display = 96;
            break;
        case 7:
            width_display = 640;
            height_display = 480;
            break;
        case 8:
            width_display = 250;
            height_display = 128;
            break;
        case 9:
            width_display = 800;
            height_display = 480;
            break;
        case 10:
            width_display = 280;
            height_display = 480;
            break;
    }

    switch (dispPtype) {
        case 0:  // TFT
            mirror_width = false;
            extra_tft_bitshifting = true;  // Special case for the TFT Type
            break;
        case 1:  // EPA
            mirror_width = false;
            break;
        case 2:  // EPA1
            mirror_width = false;
            break;
        case 3:  // EPA2
            mirror_width = false;
            break;
    }

    if (giciType & 0x100)  // Some special case, needs to be tested if always correct
        mirror_width = true;

    switch (availColors) {
        case 0:  // BW
            extra_color = false;
            break;
        case 1:  // BWR
            extra_color = true;
            break;
        case 2:  // BWY
            extra_color = true;
            break;
        case 3:  // BWRY
            extra_color = true;
            break;
        case 4:  // BWRGBYO
            extra_color = true;
            break;
    }
    switch (singleDoubleMirror) {
        case 0:  // Single image
            break;
        case 1:  // 2 Images
            break;
    }

    uint32_t len_compressed = 0;
    if (canDoCompression)
        len_compressed = 4;
    uint32_t curr_input_posi = 0;
    uint32_t byte_per_line = (height_display / 8);
    if (height_display % 8 != 0)
        byte_per_line++;
    Mirrorbuffer = (uint8_t*)malloc(byte_per_line + 1);
    if (Mirrorbuffer == nullptr) {
        Serial.println("BLE Could not create Mirrorbuffer!");
        return 0;
    }
    Serial.printf("BLE Filter options:\r\n");
    Serial.printf("screenResolution %d\r\n", screenResolution);
    Serial.printf("dispPtype %d\r\n", dispPtype);
    Serial.printf("availColors %d\r\n", availColors);
    Serial.printf("special_color %d\r\n", special_color);
    Serial.printf("singleDoubleMirror %d\r\n", singleDoubleMirror);
    Serial.printf("canDoCompression %d\r\n", canDoCompression);
    Serial.printf("byte_per_line %d\r\n", byte_per_line);
    Serial.printf("width_display %d\r\n", width_display);
    Serial.printf("height_display %d\r\n", height_display);
    Serial.printf("mirror_width %d\r\n", mirror_width);
    for (int i = 0; i < width_display; i++) {
        if (canDoCompression) {
            buffer[len_compressed++] = 0x75;
            buffer[len_compressed++] = byte_per_line + 7;
            buffer[len_compressed++] = byte_per_line;
            buffer[len_compressed++] = 0x00;
            buffer[len_compressed++] = 0x00;
            buffer[len_compressed++] = 0x00;
            buffer[len_compressed++] = 0x00;
        }
        if (mirror_width) {
            for (int b = 0; b < byte_per_line; b++) {
                Mirrorbuffer[b] = ~queueItem->data[curr_input_posi++];
            }
            for (int b = byte_per_line - 1; b >= 0; b--) {
                buffer[len_compressed++] = swapBits(Mirrorbuffer[b]);
            }
        } else {
            for (int b = 0; b < byte_per_line; b++) {
                buffer[len_compressed++] = ~queueItem->data[curr_input_posi++];
            }
        }
    }
    if (extra_color) {
        for (int i = 0; i < width_display; i++) {
            if (canDoCompression) {
                buffer[len_compressed++] = 0x75;
                buffer[len_compressed++] = byte_per_line + 7;
                buffer[len_compressed++] = byte_per_line;
                buffer[len_compressed++] = 0x00;
                buffer[len_compressed++] = 0x00;
                buffer[len_compressed++] = 0x00;
                buffer[len_compressed++] = 0x00;
            }
            if (mirror_width) {
                for (int b = 0; b < byte_per_line; b++) {
                    if (queueItem->len <= curr_input_posi)
                        Mirrorbuffer[b] = 0x00;  // Do not anything outside of the buffer!
                    else
                        Mirrorbuffer[b] = queueItem->data[curr_input_posi++];
                }
                for (int b = byte_per_line - 1; b >= 0; b--) {
                    buffer[len_compressed++] = swapBits(Mirrorbuffer[b]);
                }
            } else {
                for (int b = 0; b < byte_per_line; b++) {
                    if (queueItem->len <= curr_input_posi) {
                        buffer[len_compressed++] = 0x00;  // Do not anything outside of the buffer!
                    } else {
                        buffer[len_compressed++] = queueItem->data[curr_input_posi++];
                    }
                }
            }
        }
    }
    if (canDoCompression) {
        buffer[0] = len_compressed & 0xff;
        buffer[1] = (len_compressed >> 8) & 0xff;
        buffer[2] = (len_compressed >> 16) & 0xff;
        buffer[3] = (len_compressed >> 24) & 0xff;
    }
    free(Mirrorbuffer);
    return len_compressed;
}

uint32_t get_ATC_BLE_OEPL_image(uint8_t address[8], uint8_t* buffer, uint32_t max_len, uint8_t* dataType, uint8_t* dataTypeArgument, uint16_t* nextCheckIn) {
    uint32_t t = millis();
    PendingItem* queueItem = getQueueItem(address, 0);
    if (queueItem == nullptr) {
        prepareCancelPending(address);
        Serial.printf("blockrequest: couldn't find taginfo %02X%02X%02X%02X%02X%02X%02X%02X\r\n", address[7], address[6], address[5], address[4], address[3], address[2], address[1], address[0]);
        return 0;
    }
    if (queueItem->data == nullptr) {
        fs::File file = contentFS->open(queueItem->filename);
        if (!file) {
            Serial.print("No current file. " + String(queueItem->filename) + " Canceling request\r\n");
            prepareCancelPending(address);
            return 0;
        }
        queueItem->data = getDataForFile(file);
        Serial.println("Reading file " + String(queueItem->filename) + " in  " + String(millis() - t) + "ms");
        file.close();
    }
    if (queueItem->len > max_len) {
        Serial.print("The upload is too big better cencel it\r\n");
        prepareCancelPending(address);
        return 0;
    }
    *dataType = queueItem->pendingdata.availdatainfo.dataType;
    *dataTypeArgument = queueItem->pendingdata.availdatainfo.dataTypeArgument;
    *nextCheckIn = queueItem->pendingdata.availdatainfo.nextCheckIn;
    uint32_t len_compressed = queueItem->len;
    memcpy(buffer, queueItem->data, queueItem->len);
    Serial.print("Data is prepared Len: " + String(queueItem->len) + "\r\n");
    return queueItem->len;
}

